ПомощникHR/src/Documents/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакансии</name>
  <attributes>
    <name>Работодатель</name>
    <type>
      <types>CatalogRef.Работодатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкладОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпытОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпытДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаВакансию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОклада</name>
    <type>
      <types>EnumRef.ТипыОкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеХарактеристик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеФункцОбязанностей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФункциональныеОбязанности</name>
    <attributes>
      <name>ФункциональнаяОбязанность</name>
      <type>
        <types>CatalogRef.ФункциональныеОбязанности</types>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПомощникHR/src/Documents/Вакансии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеХарактеристик = "";
	ПредставлениеФункцОбязанностей = "";
	
	Для Каждого Строка Из Характеристики Цикл
		Если Не Строка.Требуется Тогда
			Продолжить;
		КонецЕсли;
		
		ПредставлениеХарактеристик = ПредставлениеХарактеристик + ?(ПредставлениеХарактеристик = "", 
			Строка.Характеристика, ";" + Строка.Характеристика);	
	КонецЦикла;	
		
	Для Каждого Строка Из ФункциональныеОбязанности Цикл
		Если Не Строка.Требуется Тогда
			Продолжить;
		КонецЕсли;
		
		ПредставлениеФункцОбязанностей = ПредставлениеФункцОбязанностей + ?(ПредставлениеФункцОбязанностей = "", 
			Строка.ФункциональнаяОбязанность, ";" + Строка.ФункциональнаяОбязанность);	
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
